HTTP_TIMEOUT: int = 10  # in seconds
TOCHKA_BASE_API_URL: str = "https://enter.tochka.com/uapi"
TOCHKA_SANDBOX_API_URL: str = "https://enter.tochka.com/sandbox/v2"
TOCHKA_SANDBOX_VALID_TOKEN: str = "working_token"
TOCHKA_SANDBOX_INVALID_TOKEN: str = "invalid_token"
# fmt: off
CHARS_FOR_PURPOSE = {
    '`', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', '~', '!', '@', '#', '$', '%', '^',
    '&', '*', '(', ')', '_', '+', 'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '[', ']', 'Q', 'W',
    'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '{', '}', 'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';',
    "'", 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', ':', '"', 'z', 'x', 'c', 'v', 'b', 'n', 'm', ',',
    '.', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', '<', '>', '?', 'й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ',
    'з', 'х', 'ъ', 'Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ', 'ф', 'ы', 'в', 'а', 'п',
    'р', 'о', 'л', 'д', 'ж', 'э', 'Ф', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э', 'я', 'ч', 'с',
    'м', 'и', 'т', 'ь', 'б', 'ю', '.', 'Я', 'Ч', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', '\\', '/', '|',
    ' ', 'ё', 'Ё', '№'
}
# fmt: on
